sample_app/app/controllers/users_controller.rb

  def update
    if @user.update_attributes(user_params)
---
UPDATE "users" SET "name" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["name", "Wendy Allen"], ["password_digest", "$2a$10$ZVBiPLidu6qlqwb4lpQHuu4/T/HSfodQvHC/lMWI0Yi9L0v2zGwKK"], ["updated_at", Tue, 22 Apr 2014 00:12:01 UTC +00:00]]